# essentials
cask "ghostty"
brew "zsh"
brew "tmux"
brew "vim"
brew "git"

# gnu utils
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "wget"
brew "bash"
brew "less"
brew "gnupg"

# modern utils
brew "bat"
brew "bat-extras"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "diff-so-fancy"
brew "tldr"
brew "asdf"
brew "httpie"

# dev tools
brew "just"
brew "git-lfs"
cask "claude-code"

# aws
brew "awscli"
brew "session-manager-plugin"
brew "granted", args: ["HEAD"]
brew "keidarcy/tap/e1s"

# sdks
brew "sdkman/tap/sdkman-cli"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk10"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8"
